{
  "start": {
    "text": "Ты стоишь у заброшенного дома на краю леса. Ночь. Ветер завывает, раскачивая ветви, словно тени шепчут твое имя. Изнутри доносятся скрипы и тихие стоны. Что будешь делать?",
    "options": [
      {"text": "Войти в дом", "next": "inside"},
      {"text": "Обойти дом снаружи", "next": "outside"}
    ]
  },
  "inside": {
    "text": "Внутри дома темно и ледяной холод пробирает до костей. Скрип пола словно чей-то хриплый смех. На стенах старые пятна, похожие на кровь.",
    "options": [
      {"text": "Подняться на второй этаж", "next": "upstairs"},
      {"text": "Выйти обратно", "next": "start"}
    ]
  },
  "outside": {
    "text": "Обходя дом, ты замечаешь тропинку в лес, земля под ногами свежая, словно кто-то недавно её протоптал. Вдруг лес затаил дыхание, и кажется, что за тобой кто-то наблюдает.",
    "options": [
      {"text": "Пойти по тропинке", "next": "forest"},
      {"text": "Вернуться к дому", "next": "start"}
    ]
  },
  "upstairs": {
    "text": "На втором этаже ты находишь старый дневник. Страницы покрыты странными символами и красными пятнами. Вдруг дверь с грохотом захлопывается, и воздух наполняется запахом гнили и железа. Твое сердце колотится.",
    "options": [
      {"text": "Открыть окно и спрыгнуть", "next": "escape"},
      {"text": "Исследовать комнату дальше", "next": "haunted_room"}
    ]
  },
  "forest": {
    "text": "Ты идешь по тропинке, и вдруг деревья словно оживают. В темноте мелькают силуэты с кровавыми лицами. Шаги приближаются — не человеческие, а скрежет когтей по земле.",
    "options": [
      {"text": "Бежать обратно", "next": "death_chase"},
      {"text": "Спрятаться за деревом", "next": "hide"}
    ]
  },
  "haunted_room": {
    "text": "Комната оживает. Стены покрываются свежей кровью, из которой проступают слова: «Ты следующий». Тени оживают, и из пола тянутся руки, хватает за ноги. Твоя история заканчивается здесь — крики растворяются в ночи.",
    "options": []
  },
  "escape": {
    "text": "Ты спрыгнул из окна, но земля под ногами липкая и холодная — это кровь. Крики слышатся сзади, но ты бежишь, пока лес не поглотил тебя. Конец.",
    "options": []
  },
  "hide": {
    "text": "Фигура с кровавым лицом проходит мимо, зловеще шепча твое имя. Ты замираешь, дрожа, и ощущаешь запах страха и гнили. Она ушла… на этот раз. Конец.",
    "options": []
  },
  "death_chase": {
    "text": "Ты бежишь, но лес как будто живет своей зловещей жизнью — корни хватают ноги, ветви цепляются за руки. Что-то царапает спину и лицо. Ты падаешь, слыша хриплый смех, а потом — темнота. Конец.",
    "options": []
  }
}
